import type { BookType } from './bookType';

export const bookProgramming: BookType[] = [
  {
    name: '良いコード／悪いコードで学ぶ設計入門 ―保守しやすい　成長し続けるコードの書き方',
    link: '4lMo0UJ',
    image: '81uCm6qpj7L._SY522_',
    desc: '本書は悪いコードで最初にアンチパターンを知り、その後に良いコード・良い設計を学ぶ構成になります。保守しやすい良いコードを書くために必要な知識が学べますので、ぜひ読んでみてください。',
  },
  {
    name: '達人プログラマー(第2版): 熟達に向けたあなたの旅',
    link: '4cL8lUh',
    image: '816iLrKIvcL._SY522_',
    desc: 'プログラマーにとってのバイブルでもある達人プログラマーの第2版。第1版の出版から20年ぶりの改定になります。本書では達人プログラマーになるための考え方のTipsが多数紹介されています。プログラマーとして成長したい方は、ぜひ読んでみてください！',
  },
  {
    name: 'Webを支える技術 -HTTP、URI、HTML、そしてREST',
    link: '4lptG7q',
    image: '61wuUjGEoML._SY522_',
    desc: 'Webエンジニアとして働くにあたってWebの基礎知識は必須です。最初にHTTP,URI,HTML,RESTなどの仕様の歴史や設計思想を解説されており学ぶことができます。初学者こそWebの基礎について、ぜひこの本から学んでみることをおすすめします！',
  },
  {
    name: 'Good Code, Bad Code ～持続可能な開発のためのソフトウェアエンジニア的思考',
    link: '40HFwRH',
    image: '81VS3ZONcSL._SY522_',
    desc: '本書も「良いコード／悪いコードで学ぶ設計入門」のように、悪いコードから良いコードを学ぶという構成になっています。より良いコードを書きたいという方は、こちらの本もぜひ読んでみてください！',
  },
  {
    name: 'プリンシプル オブ プログラミング 3年目までに身につけたい 一生役立つ101の原理原則',
    link: '4slWxMX',
    image: '61IQxm626YL._SY522_',
    desc: '本書では、よいコードを書く上で指針となるプリンシプル(原則)を7つの章立てで紹介しています。抽象的な概念のみが紹介されており、サンプルコードなどは無いですが、各原則には出典書籍や関連書籍が記載されているので、本書を足掛かりに他の本を読むブックガイド的な側面もこの本にはあるので、ぜひ手元に置いてみてください。',
  },
  {
    name: 'SOFT SKILLS ソフトウェア開発者の人生マニュアル 第2版',
    link: '4v9zY0a',
    image: '718dwQ3d4LL._SY522_',
    desc: '本書は、いいソフトウェア開発者になるための方法を教えてくれる本でもあり、キャリアのマネジメント、目標の達成、人生の楽しみ方について書かれています。良いコードの書き方などの技術的な内容は書かれていませんが、自己啓発書のように読めばやる気が出るタイプの本になります。ソフトウェア開発者としての人生をより良くしたい方は、ぜひ読んでみてください！',
  },
  {
    name: '［作って学ぶ］ブラウザのしくみ──HTTP、HTML、CSS、JavaScriptの裏側',
    link: '45ZsylU',
    image: '81fO73On7jL._SY522_',
    desc: '本書はRustを用いて自作のWebブラウザを作ることで、ブラウザのしくみを学ぶ本です。HTMLだけではなく一部だけですが、CSSによる装飾やJavaScriptによるコードの実行などもこのブラウザで作ることができます。ブラウザのしくみを実際に自分で作りながら知りたい方はぜひ読んでみてください！',
  },
  {
    name: 'CODE コードから見たコンピュータのからくり　第2版',
    link: '3Ja7Kio',
    image: '61pqFpe5mdL._SY522_',
    desc: 'コンピュータは0と1で動くと聞いたことがある方は多いかと思います。本書は、バイナリーのモールス信号の説明から始まり、点字・QRコードの説明から、論理回路の説明まで図を用いて丁寧に解説されています。最後の方では、これら論理回路を組み合わせてCPUがどのように動いているかなども解説しています。コンピュータがどのように動いているか知りたい方は、ぜひ読んでみてください！',
  },
];
