import type { BookType } from './bookType';

export const bookDesign: BookType[] = [
  {
    name: 'ノンデザイナーズ・デザインブック [第4版]',
    link: '3CADoma',
    image: '61JAysNAYBL._SY522_',
    desc: 'デザインをよく知らないエンジニアでもデザインの「4つの基本原則」（近接、整列、反復、対比）は知っていたほうが良いでしょう。本書でぜひデザインの「4つの基本原則」を学んでみてください。',
  },
  {
    name: '配色の教科書-歴史上の学者・アーティストに学ぶ「美しい配色」のしくみ',
    link: '4k5kLq6',
    image: '61F1ASJLGNS._SY522_',
    desc: '色について知りたいと思いませんか？本書は、色の基礎から配色の基本を歴史を追って学ぶことができます。色や配色について知識を得たい方はまずこの本から始めてみましょう。',
  },
  {
    name: '幾何学パターンづくりのすべて ファッション、建築、デザインのためのリピートパターン制作ガイド',
    link: '4liDQpJ',
    image: '71OxyYXkJIL._SY522_',
    desc: 'デザインの経験がない方でも、文字やシンプルな図形を用いて操作を行うことで、さまざまな魅力的なパターンが制作できます。パターンづくりの基礎を学びたい方や、表現の引き出しを増やしたい方におすすめです。',
  },
];
