import type { BookType } from './bookType';

export const bookDesign: BookType[] = [
  {
    name: 'ノンデザイナーズ・デザインブック [第4版]',
    link: '4kuG30B',
    image: '61JAysNAYBL._SY522_',
    desc: 'デザインをよく知らないエンジニアでもデザインの「4つの基本原則」（近接、整列、反復、対比）は知っていたほうが良いでしょう。本書でぜひデザインの「4つの基本原則」を学んでみてください。',
  },
  {
    name: 'デザイン解体新書',
    link: '468CzMx',
    image: '41DgQNEuYrL',
    desc: '主に書籍や雑誌などのDTPのデザインに関する書籍ではあるが、Webデザインにも活かせる内容となっています。特に文字に関しての基礎知識が学べ、プロのデザイナーがどのように考えてデザインしているのかを知ることができます。',
  },
  {
    name: 'オンスクリーン タイポグラフィ 事例と論説から考えるウェブの文字表現',
    link: '4c5SNcu',
    image: '713TBCg1A9L._SY522_',
    desc: 'ウェブサイトの文字表現を考える上で、タイポグラフィの知識は欠かせません。本書では、ウェブサイトの文字表現に関する事例や論説を通して、タイポグラフィの基本的な考え方を学ぶことができます。',
  },
  {
    name: '配色の教科書-歴史上の学者・アーティストに学ぶ「美しい配色」のしくみ',
    link: '4eDZliN',
    image: '61F1ASJLGNS._SY522_',
    desc: '色について知りたいと思いませんか？本書は、色の基礎から配色の基本を歴史を追って学ぶことができます。色や配色について知識を得たい方はまずこの本から始めてみましょう。',
  },
  {
    name: '幾何学パターンづくりのすべて ファッション、建築、デザインのためのリピートパターン制作ガイド',
    link: '4lJpPlk',
    image: '71OxyYXkJIL._SY522_',
    desc: 'デザインの経験がない方でも、文字やシンプルな図形を用いて操作を行うことで、さまざまな魅力的なパターンが制作できます。パターンづくりの基礎を学びたい方や、表現の引き出しを増やしたい方におすすめです。',
  },
];
